export const data = [
  {
    type: "doha",
    text: ["श्रीगुरु चरन सरोज रज, निज मनु मुकुरु सुधारि।", "बरनऊँ रघुबर बिमल जसु, जो दायकु फल चारि।।"],
    meaning:
      "अर्थ: मैं अपने श्री गुरु जी के चरण कमलों की धूल से अपने मन रूपी मुकुट को स्वच्छ करके श्री रघुवर के निर्मल यश का वर्णन करता हूँ, जो धर्म, अर्थ, काम, और मोक्ष को देने वाला है।",
  },
  {
    type: "doha",
    text: ["बुद्धिहीन तनु जानिके, सुमिरौं पवन-कुमार।", "बल बुधि बिद्या देहु मोहिं, हरहु कलेस बिकार।।"],
    meaning:
      "अर्थ: हे पवनपुत्र! मैं आपका उपासक हूँ, आप तो यह भी जानते हैं कि मेरा शरीर और बुद्धि निर्बल है। मुझे शक्ति, सद्बुद्धि, और ज्ञान दीजिए और मेरे दुखों और चिंताओं का अंत कर दो।",
  },
  {
    type: "chaupai",
    text: ["जय हनुमान ज्ञान गुन सागर।", "जय कपीस तिहुँ लोक उजागर।।१।।"],
    meaning:
      "अर्थ: हे हनुमान जी, हे कपीश, आप ज्ञान और अनन्त गुणों के सागर हैं। आप तीनों लोकों को प्रकाशमान करते हो, आपकी जय हो।",
  },
  {
    type: "chaupai",
    text: ["राम दूत अतुलित बल धामा।", "अंजनि-पुत्र पवनसुत नामा।।२।।"],
    meaning:
      "अर्थ: आप राम के दूत (प्रतिनिधी) व असीम एवं अद्वितीय बल, शक्ति के भण्डार (धाम) हैं। आप अंजनिपुत्र व पवनपुत्र नाम से विख्यात हैं।",
  },
  {
    type: "chaupai",
    text: ["महाबीर बिक्रम बजरंगी।", "कुमति निवार सुमति के संगी।।३।।"],
    meaning:
      "अर्थ: हे महावीर, आप अत्यन्त वीर और पराक्रमी हैं। आपके अंग वज्र के समान बलशाली हैं। आप पाप बुद्धि को दूर करने वाले और सद्बुद्धि का साथ देते हैं।",
  },
  {
    type: "chaupai",
    text: ["कंचन बरन बिराज सुबेसा।", "कानन कुण्डल कुँचित केसा।।४।।"],
    meaning:
      "अर्थ: आपका रंग स्वर्ण के समान है, सुंदर वेशभूषा धारण कर शोभामान होते हैं, आपके कानों में कुण्डल धारण करते हैं, आपके केश, घुंघराले व अत्यंत सुंदर हैं।",
  },
  {
    type: "chaupai",
    text: ["हाथ बज्र औ ध्वजा बिराजै।", "कॉंधे मूँज जनेऊ साजै।।५।।"],
    meaning: "अर्थ: आपके एक हाथ में वज्र (गदा) और दूसरे में ध्वजा होती है, आपके कंधों पर यज्ञोपवीत शोभायमान रहता है।",
  },
  {
    type: "chaupai",
    text: ["शंकर सुवन केसरी नंदन।", "तेज प्रताप महा जग बंदन।।६।।"],
    meaning:
      "अर्थ: आप शंकर के पुत्र हैं और केसरी जी को आनंद देने वाले हैं। आपकी यश और प्रतिष्ठा महान है। सारा संसार आपकी पूजा करता है।",
  },
  {
    type: "chaupai",
    text: ["विद्यावान गुणी अति चातुर।", "राम काज करिबे को आतुर।।७।।"],
    meaning:
      "अर्थ: आप सभी विद्याओं (युद्ध, योग, संस्कृत) के पूर्ण अनुभवी हैं और राम जी के सभी कार्यों को सम्पन्न करने को व्याकुल रहते हैं।",
  },
  {
    type: "chaupai",
    text: ["प्रभु चरित्र सुनिबे को रसिया।", "राम लखन सीता मन बसिया।।८।।"],
    meaning: "अर्थ: आप राम जी की कथा सुनने के रसिक हैं। आपके हृदय में राम, लक्ष्मणजी, और सीतामाता सदा वास करते हैं।",
  },
  {
    type: "chaupai",
    text: ["सूक्ष्म रूप धरि सियहिं दिखावा।", "बिकट रूप धरि लंक जरावा।।९।।"],
    meaning:
      "अर्थ: आप योग-बल से छोटा रूप बनाकर सीता जी के सामने प्रकट हुए और विशाल और भयानक रूप धारण करके लंका को जला डाला।",
  },
  {
    type: "chaupai",
    text: ["भीम रूप धरि असुर सँहारे।", "रामचंद्र के काज सँवारे।।१०।।"],
    meaning:
      "अर्थ: राम-रावण युद्ध में आपने विशाल और भयानक रूप धारण करके राक्षसों का संहार किया, और रामचंद्र जी के अनेक कार्य सम्पन्न किए।",
  },
  {
    type: "chaupai",
    text: ["लाय सजीवन लखन जियाये।", "श्रीरघुबीर हरषि उर लाये।।११।।"],
    meaning:
      "अर्थ: आपने हिमालय से संजीवनी बूटी लाकर लक्ष्मण जी को जीवित किया, और प्रभु राम ने प्रसन्न हो भाई की भांति आपको छाती से लगा लिया।",
  },
  {
    type: "chaupai",
    text: ["रघुपति कीन्ही बहुत बड़ाई।", "तुम मम प्रिय भरतहि सम भाई।।१२।।"],
    meaning: "अर्थ: प्रभु राम जी ने आपकी बहुत प्रशंसा की और कहा, 'हनुमान! तुम भरत के समान ही मेरे प्रिय भाई हो।'",
  },
  {
    type: "chaupai",
    text: ["सहस बदन तुम्हरो यश गावैं।", "अस कहि श्रीपति कंठ लगावैं।।१३।।"],
    meaning:
      "अर्थ: सहस्त्रों मुख तुम्हारा यश गान कर रहे हैं, यह कहकर लक्ष्मीपति भगवान ने पुनः हनुमान जी को गले लगा लिया।",
  },
  {
    type: "chaupai",
    text: ["सनकादिक ब्रह्मादि मुनीसा।", "नारद सारद सहित अहीसा।।१४।।"],
    meaning: "अर्थ: यह सारे ऋषि-मुनि, देवी-देवता, और ब्रह्मा जी, सरस्वती, नारद, सभी आपके साथ हैं। </span>",
  },
  {
    type: "chaupai",
    text: ["यम कुबेर दिगपाल जहाँ ते।", "कवि कोविद कहि सके कहाँ ते।।१५।।"],
    meaning: "अर्थ: यमराज, कुबेर जी, और अन्य ज्ञानी लोग सभी आपका गुणगान करते हैं। बोलो पवनपुत्र हनुमान जी की जय।",
  },
  {
    type: "chaupai",
    text: ["तुम उपकार सुग्रीवहिं कीन्हा।", "राम मिलाय राज पद दीन्हा।।१६।।"],
    meaning:
      "अर्थ: आपने सुग्रीव जी को श्री राम से मिलवाकर उन पर महान उपकार किया, राम से मिलन से ही उन्हें किष्किन्धा का राज्य प्राप्त हुआ।",
  },
  {
    type: "chaupai",
    text: ["तुम्हरो मंत्र बिभीषन माना।", "लंकेस्वर भये सब जग जाना।।१७।।"],
    meaning:
      "अर्थ: आपका परामर्श मानकर विभीषण प्रभु राम की शरण में गए, जिसके कारण वे लंका के राजा बने, यह बात सारे संसार जानता है।",
  },
  {
    type: "chaupai",
    text: ["जुग सहस्र योजन पर भानू।", "लील्यो ताहि मधुर फल जानू।।१८।।"],
    meaning: "अर्थ:- आपने बाल्यकाल में हजारों योजन की दूरी पर स्थित सूर्य को एक मधुर(मीठा) फलजान मुँह में रख लिया था।",
  },
  {
    type: "chaupai",
    text: ["प्रभु मुद्रिका मेलि मुख माहीं।", "जलधि लाँघि गये अचरज नाहीं।।१९।।"],
    meaning:
      "अर्थ: वह मुद्रिका, जो समस्त कार्यों को पूरा करने वाली थी और सभी विघ्नबाधाओं को हराने वाली थी, उसे मुँह में रखकर आपने विशाल समुंदर को पार किया, इसमें अचरज नहीं है।",
  },
  {
    type: "chaupai",
    text: ["दुर्गम काज जगत के जेते।", "सुगम अनुग्रह तुम्हरे तेते।।२०।।"],
    meaning: "अर्थ: संसार में लोगों के जितने भी कठिन कार्य हैं, वे आपकी कृपा से सरल हो जाते हैं। </span>",
  },
  {
    type: "chaupai",
    text: ["राम दुआरे तुम रखवारे।", "होत न आज्ञा बिनु पैसारे।।२१।।"],
    meaning:
      "अर्थ: प्रभु राम के द्वार (बैकुण्ठ) के आप रखवाले हैं, और आपकी आज्ञा के बिना कोई भी उस धाम में प्रवेश नहीं कर सकता।",
  },
  {
    type: "chaupai",
    text: ["सब सुख लहै तुम्हारी सरना।", "तुम रक्षक काहू को डरना।।२२।।"],
    meaning:
      "अर्थ: जो आपकी शरण में आता है, वह सभी सुखों को प्राप्त करता है, और जब आप स्वयं उसके रक्षक हैं, तो उसे फिर किस बात का डर है।",
  },
  {
    type: "chaupai",
    text: ["आपन तेज सम्हारो आपै।", "तीनों लोक हाँक तै काँपै।।२३।।"],
    meaning:
      "अर्थ: आपका तेज अत्यंत प्रचण्ड है, उसे स्वयं आप ही सम्भाल सकते हैं। आपकी एक हुँकार से ही तीनों लोक कांप उठते हैं।",
  },
  {
    type: "chaupai",
    text: ["भूत पिसाच निकट नहिं आवै।", "महावीर जब नाम सुनावै।।२४।।"],
    meaning:
      "अर्थ: यदि किसी को भूत-पिशाच दिखाई देते हैं, तो हे महावीर जी, आपका नाम लेने ही से वह तुरंत भाग जाते हैं। (आपका नाम राम बाण) की भाँति है।",
  },
  {
    type: "chaupai",
    text: ["नासै रोग हरै सब पीरा।", "जपत निरंतर हनुमत बीरा।।२५।।"],
    meaning:
      "अर्थ: आपके नाम का निरंतर जाप करने से सभी रोग और पीड़ाएं (भौतिक, दैविक, और आध्यात्मिक) ये तीनों ताप भी दूर हो जाते हैं।",
  },
  {
    type: "chaupai",
    text: ["संकट ते हनुमान छुड़ावै।", "मन क्रम बचन ध्यान जो लावै।।२६।।"],
    meaning:
      "अर्थ: जो व्यक्ति मन, वाणी, और शरीर से हनुमान जी का स्मरण और पूजा करते हैं, हनुमान जी उनके सभी संकटों को दूर कर देते हैं।",
  },
  {
    type: "chaupai",
    text: ["सब पर राम तपस्वी राजा।", "तिनके काज सकल तुम साजा।।२७।।"],
    meaning:
      "अर्थ: तपस्वी राम सारे संसार के राजा (स्वामी) हैं, फिर भी हनुमान जी आपने उनके सभी कठिन कार्यों को सम्पन्न किया।",
  },
  {
    type: "chaupai",
    text: ["और मनोरथ जो कोई लावै।", "सोइ अमित जीवन फल पावै।।२८।।"],
    meaning:
      "अर्थ: जो कोई अपनी सांसारिक इच्छा लेकर आता है, उसे आप पूरा करते हैं। पर साथ ही राम भक्ति का मार्ग दिखाते हैं, जिससे मनुष्य जीवन का अमूल्य फल (मोक्ष) प्राप्त करता है।",
  },
  {
    type: "chaupai",
    text: ["चारों जुग परताप तुम्हारा।", "है परसिद्ध जगत उजियारा।।२९।।"],
    meaning:
      "अर्थ: आपका प्रभाव चारों युगों (सतयुग, त्रेतायुग, द्वापर और कलियुग) में फैला है, और वह प्रताप से जगत को प्रकाशित करने के लिए प्रसिद्ध है।",
  },
  {
    type: "chaupai",
    text: ["साधु संत के तुम रखवारे।", "असुर निकंदन राम दुलारे।।३०।।"],
    meaning:
      "अर्थ: आप सज्जनों और प्रभु भक्तों की रक्षा करने वाले हैं और दुष्टों का नाश करने वाले हैं। प्रभु राम को पुत्र के समान प्रिय हैं।",
  },
  {
    type: "chaupai",
    text: ["अष्ट सिद्धि नौ निधि के दाता।", "अस बर दीन जानकी माता।।३१।।"],
    meaning:
      "अर्थ: आपको माता सीता की ओर से आठ सिद्धियों और नौ निधियों का जो वरदान मिला है, उनकी शक्ति से आप किसी को भी सब प्रकार की सम्पत्ति दे सकते हैं।",
  },
  {
    type: "chaupai",
    text: ["राम रसायन तुम्हरे पासा।", "सदा रहो रघुपति के दासा।।३२।।"],
    meaning:
      "अर्थ: आपके पास राम भक्ति रूपी रसायन है, जो किसी को भी सर्वोत्तम बना सकता है। आप रघुपति दास के रूप में लोगों को राम भक्त बनाते हैं।",
  },
  {
    type: "chaupai",
    text: ["तुम्हरे भजन राम को पावै।", "जनम जनम के दुख बिसरावै।।३३।।"],
    meaning: "अर्थ: आपके लिए किए गए सभी भजन श्री राम तक पहुंचते हैं, जिससे जन्म-जन्मांतर के दुख दूर हो जाते हैं।",
  },
  {
    type: "chaupai",
    text: ["अन्त काल रघुबर पुर जाई।", "जहाँ जन्म हरि-भक्त कहाई।।३४।।"],
    meaning:
      "अर्थ: आपके भजनों की कृपा से ही प्राणी अंत समय श्री राम के धाम को प्राप्त करते हैं, और यदि मृत्युलोक में जन्म लेंगे, तो भक्ति करेंगे और हरि-भक्त कहलाएंगे।",
  },
  {
    type: "chaupai",
    text: ["और देवता चित्त न धरई।", "हनुमत सेइ सर्व सुख करई।।३५।।"],
    meaning:
      "अर्थ: राम भक्ति में (कृष्ण, विष्णु, शिव) सब एक हैं। हे हनुमान जी, जो भक्त सच्चे मन से आपकी सेवा करते हैं, उन्हें सभी सुख प्राप्त होते हैं।",
  },
  {
    type: "chaupai",
    text: ["संकट कटै मिटै सब पीरा।", "जो सुमिरै हनुमत बलबीरा।।३६।।"],
    meaning:
      "अर्थ: महावीर जी की उपासना भक्ति से मनुष्य के सारे संकट, कष्ट, और दुख मिट जाते हैं। वह से जन्म-मरण (भव) की पीड़ा मुक्त हो जाता है।",
  },
  {
    type: "chaupai",
    text: ["जै जै जै हनुमान गोसाईं।", "कृपा करहु गुरुदेव की नाईं।।३७।।"],
    meaning:
      "अर्थ: हे हनुमान जी, हे गोस्वामी जी (जिन्होंने अपनी दस इंद्रियों को वश में किया हो), आपकी जय हो। गुरु की भांति मुझ पर कृपा करें।",
  },
  {
    type: "chaupai",
    text: ["जो सत बार पाठ कर कोई।", "छूटहिं बंदि महासुख होई।।३८।।"],
    meaning:
      "अर्थ: जो व्यक्ति हनुमान चालीसा का शत (निरंतर) पाठ करता है, वह जन्म-मरण के बंधन से मुक्त हो शाश्वत् आनंद प्राप्त करता है।",
  },
  {
    type: "chaupai",
    text: ["जो यह पढ़ै हनुमान चालीसा।", "होय सिद्धि साखी गौरीसा।।३९।।"],
    meaning:
      "अर्थ: जो व्यक्ति हनुमान चालीसा को पढ़ता है, उसकी सभी मनोकामनाएं सफल होती हैं, इस बात की साक्षी स्वयं भगवान शंकर ने दी है।",
  },
  {
    type: "chaupai",
    text: ["तुलसीदास सदा हरि चेरा।", "कीजै नाथ हृदय महँ डेरा।।४०।।"],
    meaning:
      "अर्थ: तुलसीदास जी कहते हैं कि हे प्रभु, आप राम के दास हैं और मैं आपका दास हूँ। अतएव हे श्री हनुमान जी, आप मेरे हृदय में विराजें।",
  },
  {
    type: "doha",
    text: ["पवन तनय संकट हरन, मंगल मूरति रूप।", "रामलखन सीता सहित, हृदय बसहु सुर भूप।।"],
    meaning:
      "अर्थ: हे पवन पुत्र! संकटों, दुखों, कष्टों को दूर करने वाले और परमकल्याण की साक्षात मूर्ति, आप जो देवताओं के राजा हैं। राम, लक्ष्मण, सीता जी के साथ मेरे हृदय में वास कीजिए।",
  },
];
